{
    "page_content": "3GPP TSG-CT WG1 Meeting #147\tC1-241256\nAthens, Greece, 26 February-1 March 2024\n\n\n\n\n* * * First Change * * * *\n4.6.1\tGeneral\nThe 5GS supports network slicing as described in 3GPP TS 23.501 [8]. Within a PLMN or SNPN, a network slice is identified by an S-NSSAI, which is comprised of a slice/service type (SST) and a slice differentiator (SD). Inclusion of an SD in an S-NSSAI is optional. A set of one or more S-NSSAIs is called the NSSAI. The following S-NSSAIs and NSSAIs are defined in 3GPP TS 23.501 [8]:\na)\tconfigured NSSAI;\nb)\trequested NSSAI;\nc)\tallowed NSSAI;\nd)\tsubscribed S-NSSAIs;\ne)\tpending NSSAI;\nf)\talternative S-NSSAIs; and\ng)\tpartially allowed NSSAI.\nThe following NSSAIs are defined in the present document:\na)\trejected NSSAI for the current PLMN or SNPN;\nb)\trejected NSSAI for the current registration area;\nc)\trejected NSSAI for the failed or revoked NSSAA;\nd)\trejected NSSAI for the maximum number of UEs reached;\ne)\talternative NSSAI; and\nf)\tpartially rejected NSSAI.\nIn roaming scenarios, rejected NSSAI for the current PLMN or SNPN, rejected NSSAI for the current registration area, rejected NSSAI for the maximum number of UEs reached, or partially rejected NSSAI includes one or more S-NSSAIs for the current PLMN and also contains a set of mapped S-NSSAI(s). An S-NSSAI included in the rejected NSSAI for the failed or revoked NSSAA is an HPLMN S-NSSAI.\nIn case of a PLMN, a serving PLMN may configure a UE with:\na)\tthe configured NSSAI per PLMN;\nb)\tNSSRG information if the UE has indicated that it supports the subscription-based restrictions to simultaneous registration of network slices feature;\nc)\t if the UE has indicated it supports the network slice usage control feature;\nd)\tS-NSSAI time validity information if the UE has indicated that it supports S-NSSAI time validity information; and\ne)\tS-NSSAI location validity information if the UE has indicated that it supports S-NSSAI location validity information.\nIn addition, the HPLMN may configure a UE with a single default configured NSSAI and consider the default configured NSSAI as valid in a PLMN for which the UE has neither a configured NSSAI nor an allowed NSSAI. The support for NSSRG information by the UE and the network, respectively, is optional.\nNOTE 0:\tThe network slice usage control feature is not supported in roaming scenarios.\nNOTE 1:\tThe value(s) used in the default configured NSSAI are expected to be commonly decided by all roaming partners, e.g., values standardized by 3GPP or other bodies.\nIn case of an SNPN, the SNPN may configure a UE which is neither registering nor registered for onboarding services in SNPN with:\na)\ta configured NSSAI applicable to the SNPN;\nb)\tNSSRG information if the UE has indicated that it supports the subscription-based restrictions to simultaneous registration of network slices feature;\nc)\tS-NSSAI time validity information if the UE has indicated that it supports S-NSSAI time validity information;\nd)\t if the UE has indicated it supports the network slice usage control feature; and\ne)\tS-NSSAI location validity information if the UE has indicated that it supports S-NSSAI location validity information.\nIn addition, the credential holder may configure a single default configured NSSAI associated with the selected entry of the \"list of subscriber data\" or the PLMN subscription and consider the default configured NSSAI as valid in a SNPN for which the UE has neither a configured NSSAI nor an allowed NSSAI. If the UE is registering or registered for onboarding services in SNPN, the serving SNPN shall not provide a configured NSSAI to the UE. The support for NSSRG information by the UE and the network, respectively, is optional.\nThe allowed NSSAI and the rejected NSSAI for the current registration area are managed per access type independently, i.e. 3GPP access or non-3GPP access, and is applicable for the registration area. If the UE does not have a valid registration area, the rejected NSSAI for the current registration area is applicable to the tracking area on which it was received. If the registration area contains TAIs belonging to different PLMNs, which are equivalent PLMNs, the allowed NSSAI, the rejected NSSAI for the current registration area, rejected NSSAI for the failed or revoked NSSAA and rejected NSSAI for the maximum number of UEs reached are applicable to these PLMNs in this registration area.\nThe allowed NSSAI that is associated with a registration area containing TAIs belonging to different PLMNs, which are equivalent PLMNs, can be used to form the requested NSSAI for any of the equivalent PLMNs when the UE is outside of the registration area where the allowed NSSAI was received.\nWhen the network slice-specific authentication and authorization procedure is to be initiated for one or more S-NSSAIs in the requested NSSAI or the network slice-specific authentication and authorization procedure is ongoing for one or more S-NSSAIs, these S-NSSAI(s) will be included in the pending NSSAI. When the network slice-specific authentication and authorization procedure is completed for an NSSAI that has been in the pending NSSAI, the S-NSSAI will be moved to the allowed NSSAI or rejected NSSAI depending on the outcome of the procedure. The AMF sends the updated allowed NSSAI to the UE over the same access of the requested S-NSSAI. The AMF sends the updated partially allowed NSSAI to the UE only over the 3GPP access. The AMF sends the updated rejected NSSAI over either 3GPP access or non-3GPP access. The pending NSSAI is managed regardless of access type i.e. the pending NSSAI is applicable to both 3GPP access and non-3GPP access for the current PLMN even if sent over only one of the accesses. If the registration area contains TAIs belonging to different PLMNs, which are equivalent PLMNs, the pending NSSAI is applicable to these PLMNs in this registration area.\nThe rejected NSSAI for the current PLMN or SNPN is applicable for the whole registered PLMN or SNPN regardless of the access type. The AMF shall only send a rejected NSSAI for the current PLMN when the registration area consists of TAIs that only belong to the registered PLMN. If the UE receives a rejected NSSAI for the current PLMN, and the registration area also contains TAIs belonging to different PLMNs, the UE shall treat the received rejected NSSAI for the current PLMN as applicable to the whole registered PLMN.\nThe rejected NSSAI for the failed or revoked NSSAA includes one or more S-NSSAIs that have failed the network slice-specific authentication and authorization or for which the authorization have been revoked, and are applicable for the whole registered PLMN or SNPN regardless of the access type.\nThe rejected NSSAI for the maximum number of UEs reached is applicable for the whole registered PLMN or SNPN, and the access type over which the rejected NSSAI was sent. The AMF shall send a rejected NSSAI including S-NSSAI(s) with the rejection cause \"S-NSSAI not available due to maximum number of UEs reached\", when one or more S-NSSAIs are indicated that the maximum number of UEs has been reached. If the timer T3526 associated with the S-NSSAI(s) was started upon reception of the rejected NSSAI for the maximum number of UEs reached, the UE may remove the S-NSSAI(s) from the rejected NSSAI including S-NSSAI(s) with the rejection cause \"S-NSSAI not available due to maximum number of UEs reached\", if the timer T3526 associated with the S-NSSAI(s) expires. If one or more S-NSSAIs are removed from the rejected NSSAI for the maximum number of UEs reached, the timer T3526 associated with the removed S-NSSAI(s) shall be stopped, if running. The UE shall not stop the timer T3526 if the UE selects an E-UTRA cell connected to EPC.\nIf the UE receives a rejected NSSAI for the maximum number of UEs reached, the registration area contains TAIs belonging to different PLMNs, which are equivalent PLMNs, the UE shall treat the received rejected NSSAI for the maximum number of UEs reached as applicable to these equivalent PLMNs when the UE is in this registration area.\nIf the UE has indicated that the UE supports network slice replacement feature and the AMF determines to provide the mapping information between the S-NSSAI to be replaced and the alternative S-NSSAI to the UE, the network shall provide the UE with the alternative NSSAI. The alternative NSSAI is managed per access type independently, i.e. 3GPP access or non-3GPP access, and is applicable for the registration area.\nIf the UE has indicated that the UE supports the partial network slice feature and includes the S-NSSAI(s) in the requested NSSAI, the AMF determines the S-NSSAI(s) to be included in the partially allowed NSSAI or the partially rejected NSSAI as specified in subclause 4.6.2.11. When the AMF provides both the partially allowed NSSAI and the partially rejected NSSAI to the UE, each S-NSSAI shall be either in the partially allowed NSSAI or in the partially rejected NSSAI but not both. The number of S-NSSAIs included in the partially allowed NSSAI or the partially rejected NSSAI shall not exceed 7. The number of S-NSSAI stored in the partially allowed NSSAI and the allowed NSSAI shall not exceed 8. The partially allowed NSSAI is only applicable to 3GPP access and is applicable for the registration area. The partially rejected NSSAI is only applicable to 3GPP access and is applicable for the registration area.\nNOTE 2:\tBased on local policies, the UE can remove an S-NSSAI from the rejected NSSAI for the failed or revoked NSSAA when the UE wants to register to the slice identified by this S-NSSAI.\nNOTE 3:\tBased on network local policy, network slice-specific authentication and authorization procedure can be initiated by the AMF for an S-NSSAI in rejected NSSAI for the failed or revoked NSSAA when the S-NSSAI is requested by the UE based on its local policy.\nNOTE 4: At least one S-NSSAI in the default configured NSSAI or at least one default S-NSSAI is recommended as not subject to network slice-specific authentication and authorization, in order to ensure that at least one PDU session can be established to access service, even when Network Slice-specific Authentication and Authorization fails.\nNOTE 5:\tAt least one S-NSSAI in the default configured NSSAI or at least one default S-NSSAI is recommended as not subject to network slice admission control, in order to ensure that at least one PDU session can be established to access service.\nNOTE 6:\tThe rejected NSSAI can be provided by the network via either Rejected NSSAI IE or the Extended rejected NSSAI IE.\n\n* * * Next Change * * * *\n4.6.2.2\tNSSAI storage\nIf available, the configured NSSAI(s) shall be stored in a non-volatile memory in the ME as specified in annex C. For a configured NSSAI, if there is:\na)\tassociated NSSRG information, the NSSRG information shall also be stored in a non-volatile memory in the ME as specified in annex C;\nb)\tassociated NSAG information, the NSAG information shall be stored in the ME;\nc)\tassociated S-NSSAI time validity information, the S-NSSAI time validity information shall also be stored in a non-volatile memory in the ME as specified in annex C;\nd)\tassociated S-NSSAI location validity information, the S-NSSAI location validity information shall also be stored in a non-volatile memory in the ME as specified in annex C; and\ne)\tassociated , the  shall also be stored in a non-volatile memory in the ME as specified in annex C.\nEach of the configured NSSAI stored in the UE, including the default configured NSSAI, is a set composed of at most 16 S-NSSAIs. Each of the configured NSSAI, except the default configured NSSAI, is associated with a PLMN identity or SNPN identity and, if the UE supports access to an SNPN using credentials from a credentials holder, equivalent SNPNs or both, the selected entry of the \"list of subscriber data\" or the selected PLMN subscription.\nThe allowed NSSAI(s) should be stored in a non-volatile memory in the ME as specified in annex C. The partially allowed NSSAI(s) should be stored in a non-volatile memory in the ME as specified in annex C. For an allowed NSSAI, if there is associated alternative NSSAI, the alternative NSSAI should also be stored in a non-volatile memory in the ME as specified in annex C.\nEach of the allowed NSSAI stored in the UE is a set composed of at most 8 S-NSSAIs and is associated with a PLMN identity or SNPN identity, an access type and, if the UE supports access to an SNPN using credentials from a credentials holder, equivalent SNPNs or both, the selected entry of the \"list of subscriber data\" or the selected PLMN subscription. Each of the alternative NSSAI stored in the UE is a set composed of at most 8 pairs of S-NSSAI to be replaced and alternative S-NSSAI, and is associated with a PLMN identity or SNPN identity, an access type and, if the UE supports access to an SNPN using credentials from a credentials holder, equivalent SNPNs or both, the selected entry of the \"list of subscriber data\" or the selected PLMN subscription. Each of the partially allowed NSSAI stored in the UE is a set composed of at most 7 S-NSSAIs and a list of TAs for which S-NSSAI is supported, and is associated with a PLMN identity or SNPN identity, 3GPP access type and, if the UE supports access to an SNPN using credentials from a credentials holder, equivalent SNPNs or both, the selected entry of the \"list of subscriber data\" or the selected PLMN subscription. The number of S-NSSAI stored in the partially allowed NSSAI and the allowed NSSAI shall not exceed 8.\nEach of the pending NSSAI stored in the UE is a set composed of at most 16 S-NSSAIs and is associated with a PLMN identity or SNPN identity and, if the UE supports access to an SNPN using credentials from a credentials holder, equivalent SNPNs or both, the selected entry of the \"list of subscriber data\" or the selected PLMN subscription.\nEach of the rejected NSSAI is associated with a PLMN identity or SNPN identity and, if the UE supports access to an SNPN using credentials from a credentials holder, equivalent SNPNs or both, the selected entry of the \"list of subscriber data\" or the selected PLMN subscription. The S-NSSAI(s) in the rejected NSSAI for the current registration area are further associated with one or more tracking areas where the rejected S-NSSAI(s) is not available. The S-NSSAI(s) in the rejected NSSAI for the maximum number of UEs reached are further associated with the access type over which the rejected NSSAI was received. The S-NSSAI(s) in the partially rejected NSSAI are further associated with 3GPP access.\nThere shall be no duplicated PLMN identities or SNPN identities associated with each of the list of configured NSSAI(s), pending NSSAI(s), rejected NSSAI(s) for the current PLMN or SNPN, rejected NSSAI(s) for the current registration area, rejected NSSAI(s) for the failed or revoked NSSAA, and rejected NSSAI for the maximum number of UEs reached.\nThe UE stores NSSAIs as follows:\na)\tThe configured NSSAI shall be stored until a new configured NSSAI is received for a given PLMN or SNPN. The network may provide to the UE the mapped S-NSSAI(s) for the new configured NSSAI which shall also be stored in the UE. When the UE is provisioned with a new configured NSSAI for a PLMN or SNPN, the UE shall:\n1)\treplace any stored configured NSSAI for this PLMN or SNPN with the new configured NSSAI for this PLMN or SNPN;\n2)\tdelete any stored mapped S-NSSAI(s) for the configured NSSAI and, if available, store the mapped S-NSSAI(s) for the new configured NSSAI;\n3)\tdelete any stored allowed NSSAI for this PLMN or SNPN and, if available, the stored mapped S-NSSAI(s) for the allowed NSSAI, if the UE received the new configured NSSAI for this PLMN or SNPN and the Configuration update indication IE with the Registration requested bit set to \"registration requested\", in the same CONFIGURATION UPDATE COMMAND message but without any new allowed NSSAI for this PLMN or SNPN included;\n4)\tdelete any stored rejected NSSAI and partially rejected NSSAI, and stop any timer T3526 associated with a deleted S-NSSAI in the rejected NSSAI for the maximum number of UEs reached if running;\n4A)\tdelete any stored mapped S-NSSAI(s) for the rejected NSSAI; and\n5)\tdelete any S-NSSAI(s) stored in the pending NSSAI that are not included in the new configured NSSAI for the current PLMN or SNPN or any mapped S-NSSAI(s), if any, stored in the pending NSSAI that are not included in the mapped S-NSSAI(s) for the configured NSSAI (if the UE is roaming or is in a non-subscribed SNPN);\n\tIf the UE having a stored configured NSSAI for a PLMN ID, receives an S-NSSAI associated with a PLMN ID from the network during the PDN connection establishment procedure in EPS as specified in 3GPP TS 24.301 [15] or via ePDG as specified in 3GPP TS 24.302 [16], the UE may store the received S-NSSAI in the configured NSSAI for the PLMN identified by the PLMN ID associated with the S-NSSAI, if not already included in the configured NSSAI and if the number of S-NSSAIs in the configured NSSAI is less than 16;\n\tThe UE may continue storing a received configured NSSAI for a PLMN and associated mapped S-NSSAI(s), if available, when the UE registers in another PLMN.\nNOTE 1:\tThe maximum number of configured NSSAIs and associated mapped S-NSSAIs for PLMNs other than the HPLMN that need to be stored in the UE, and how to handle the stored entries, are up to UE implementation.\naa)\tThe NSAG information shall be stored until:\n1)\ta new NSAG information for the registered PLMN or the registered SNPN is received over 3GPP access; or\n2)\ta new configured NSSAI without any associated NSAG information for the registered PLMN or the registered SNPN is received over 3GPP access.\n\tThe UE shall remove any S-NSSAI from the NSAG information which is not part of the configured NSSAI, if any.\nNOTE 1A:\tIf the UE is roaming or the current SNPN is a non-subscribed SNPN, the UE uses the S-NSSAI(s) in the configured NSSAI to compare against any S-NSSAI from the NSAG information.\n\tWhen a new NSAG information for the registered PLMN or the registered SNPN is received over 3GPP access, the UE shall replace any stored NSAG information for the registered PLMN and its equivalent PLMN(s) or the registered SNPN and its equivalent SNPN(s) with the new NSAG information for the registered PLMN or the registered SNPN.\n\tWhen a new configured NSSAI without any associated NSAG information for the registered PLMN or the registered SNPN is received over 3GPP access, the UE shall delete any stored NSAG information for the registered PLMN and its equivalent PLMN(s) or the registered SNPN and its equivalent SNPN(s).\n\tThe UE shall be able to store 32 NSAG entries in the NSAG information stored for the registered PLMN or the registered SNPN.\n\tThe UE shall be able to store TAI lists for up to 4 NSAG entries in the NSAG information stored for the registered PLMN or the registered SNPN.\n\tThe UE needs not to store the NSAG information when the UE is switched off or when the UE is deregistered from the registered PLMN or the registered SNPN.\nNOTE 1B:\tThe UE stores the NSAG information associated with the configured NSSAI for at least the registered PLMN and its equivalent PLMN(s) or the registered SNPN and its equivalent PLMN(s).\nb)\tThe allowed NSSAI shall be stored and the mapped S-NSSAI(s) for the allowed NSSAI (if available) shall be stored for a given PLMN and its equivalent PLMN(s) in the registration area or SNPN until:\n1)\ta new allowed NSSAI for the same access type (i.e. 3GPP access or non-3GPP access) is received for a given PLMN or SNPN;\n2)\tthe CONFIGURATION UPDATE COMMAND message with the Registration requested bit of the Configuration update indication IE set to \"registration requested\" is received and contains no other parameters (see subclauses 5.4.4.2 and 5.4.4.3);\n3)\tthe REGISTRATION ACCEPT message is received with the \"NSSAA to be performed\" indicator of the 5GS registration result IE set to \"Network slice-specific authentication and authorization is to be performed\", and the REGISTRATION ACCEPT message contains a pending NSSAI and no new allowed NSSAI as described in subclause 5.5.1.2.4 and subclause 5.5.1.3.4; or\n4)\ta new partially allowed NSSAI via 3GPP access is received for a given PLMN or SNPN.\n\tThe network may provide to the UE the mapped S-NSSAI(s) for the new allowed NSSAI (see subclauses 5.5.1.2 and 5.5.1.3) which shall also be stored in the UE. When a new allowed NSSAI for a PLMN or SNPN is received, the UE shall:\n1)\treplace any stored allowed NSSAI for this PLMN and its equivalent PLMN(s) in the registration area or this SNPN for the same access type with the new allowed NSSAI for this PLMN or SNPN;\n2)\tdelete any stored mapped S-NSSAI(s) for the allowed NSSAI for this PLMN and its equivalent PLMN(s) in the registration area or this SNPN for the same access type and, if available, store the mapped S-NSSAI(s) for the new allowed NSSAI;\n3)\tremove from the stored rejected NSSAI for the current PLMN or SNPN, the rejected NSSAI for the current registration area, rejected NSSAI for the maximum number of UEs reached and the partially rejected NSSAI, the S-NSSAI(s), if any, included in the new allowed NSSAI for the current PLMN or SNPN, unless the S-NSSAI in the rejected NSSAI or the partially rejected NSSAI is associated with one or more S-NSSAI(s) in the stored mapped rejected NSSAI or the stored mapped partially rejected NSSAI, and at least one of these mapped S-NSSAI(s) is not included in the mapped S-NSSAI(s) for the new allowed NSSAI, and stop any timer T3526 associated with a deleted S-NSSAI in the rejected NSSAI for the maximum number of UEs reached if running;\n4)\tremove from the stored rejected NSSAI for the failed or revoked NSSAA, the S-NSSAI(s), if any, included in the new allowed NSSAI for the current PLMN (if the UE is not roaming) or the current SNPN (if the SNPN is the subscribed SNPN) or the mapped S-NSSAI(s) for the new allowed NSSAI for the current PLMN (if the UE is roaming) or the current SNPN (if the SNPN is a non-subscribed SNPN);\n5)\tremove from the stored mapped S-NSSAI(s) for the rejected NSSAI for the current PLMN or SNPN, the stored mapped S-NSSAI(s) for the rejected NSSAI for the current registration area, the stored mapped S-NSSAI(s) for the partially rejected NSSAI and the mapped S-NSSAI(s) for the rejected NSSAI for the maximum number of UEs reached, the S-NSSAI(s), if any, included in the mapped S-NSSAI(s) for the new allowed NSSAI for the current PLMN (if the UE is roaming) or the current SNPN (if the SNPN is a non-subscribed SNPN), and stop any timer T3526 associated with a deleted S-NSSAI in the rejected NSSAI for the maximum number of UEs reached if running; and\n6)\tremove from the stored pending NSSAI for this PLMN and its equivalent PLMN(s) in the registration area or this SNPN, one or more S-NSSAIs, if any, included in the new allowed NSSAI for the current PLMN and these equivalent PLMN(s) (if the UE is not roaming) or the current SNPN (if the SNPN is the subscribed SNPN) or the mapped S-NSSAI(s) for the new allowed NSSAI for the current PLMN and these equivalent PLMN(s) (if the UE is roaming) or the current SNPN (if the SNPN is a non-subscribed SNPN).\nNOTE 2:\tWhether the UE stores the allowed NSSAI and the mapped S-NSSAI(s) for the allowed NSSAI also when the UE is switched off is implementation specific.\nThe network may provide to the UE the partially allowed NSSAI. When a new partially allowed NSSAI for a PLMN or SNPN is received, the UE shall replace any stored partially allowed NSSAI for this PLMN and its equivalent PLMN(s) in the registration area or this SNPN via the 3GPP access with the new partially allowed NSSAI for this PLMN or SNPN.\nba)\tThe alternative NSSAI and the mapped S-NSSAI(s) for the alternative NSSAI (if the UE is roaming) shall be stored for a given PLMN and its equivalent PLMN(s) or SNPN until a new alternative NSSAI for the same access type (i.e. 3GPP access or non-3GPP access) is received for a given PLMN or SNPN.\n\tWhen a new alternative NSSAI for a given PLMN or SNPN is received and the new alternative NSSAI includes a list of mapping information between the S-NSSAI to be replaced and the alternative S-NSSAI, the UE shall:\n1)\treplace any stored alternative NSSAI for this PLMN and its equivalent PLMN(s) or this SNPN for the same access type with the new alternative NSSAI for this PLMN or SNPN; and\n2)\tdelete any stored mapped S-NSSAI(s) for the alternative NSSAI for this PLMN and its equivalent PLMN(s) or this SNPN for the same access type and, if available, store the mapped S-NSSAI(s) for the new alternative NSSAI.\n\tWhen a new alternative NSSAI for a given PLMN or SNPN is received and the new alternative NSSAI does not include any mapping information between the S-NSSAI to be replaced and the alternative S-NSSAI, the UE shall delete any stored alternative NSSAI for this PLMN and its equivalent PLMN(s) or this SNPN for the same access type.\nNOTE 3:\tWhether the UE stores the alternative NSSAI and the mapped S-NSSAI(s) for the alternative NSSAI also when the UE is switched off is implementation specific.\nc)\tWhen the UE receives the S-NSSAI(s) included in the rejected NSSAI in the REGISTRATION ACCEPT message, the REGISTRATION REJECT message, the DEREGISTRATION REQUEST message or in the CONFIGURATION UPDATE COMMAND message, or the S-NSSAI(s) included in the partially rejected NSSAI in the REGISTRATION ACCEPT message or the CONFIGURATION UPDATE COMMAND message, the UE shall:\n1)\tstore the S-NSSAI(s) into the rejected NSSAI and the mapped S-NSSAI(s) for the rejected NSSAI based on the associated rejection cause(s);\n2)\tif the UE receives the S-NSSAI(s) included in the Rejected NSSAI IE, or if the UE receives the S-NSSAI(s) included in the Extended rejected NSSAI IE, or if the UE receives the S-NSSAI(s) included in the Partially rejected NSSAI IE in non-roaming case when not in SNPN access operation mode or in the subscribed SNPN, remove from the stored allowed NSSAI or partially allowed NSSAI for the current PLMN and its equivalent PLMN(s) in the registration area or the current SNPN, the S-NSSAI(s), if any, included in the:\ni)\trejected NSSAI for the failed or revoked NSSAA, for each and every access type;\nii)\trejected NSSAI for the current PLMN or SNPN, for each and every access type;\niii)\trejected NSSAI for the current registration area, associated with the same access type;\niv)\trejected NSSAI for the maximum number of UEs reached, associated with the same access type; or\nv)\tpartially rejected NSSAI, associated with 3GPP access;\n3)\tif the UE receives the S-NSSAI(s) included in the Extended rejected NSSAI IE or if the UE receives the S-NSSAI(s) included in the Partially rejected NSSAI IE in roaming case or in a non-subscribed SNPN, remove from the stored allowed NSSAI or partially allowed NSSAI for the current PLMN and its equivalent PLMN(s) in the registration area or the current SNPN, the S-NSSAI(s), if any, included in the:\ni)\trejected NSSAI for the current PLMN or SNPN, for each and every access type;\nii)\trejected NSSAI for the current registration area, associated with the same access type;\niii)\trejected NSSAI for the maximum number of UEs reached, associated with the same access type; or\niv)\tpartially rejected NSSAI, associated with 3GPP access;\n\tif the mapped S-NSSAI(s) for the S-NSSAI in the stored allowed NSSAI or partially allowed NSSAI for the current PLMN or SNPN are stored in the UE, and all of the mapped S-NSSAI(s) are included in the Extended rejected NSSAI IE or Partially rejected NSSAI IE;\n4)\tremove from the stored mapped S-NSSAI(s) for the allowed NSSAI or partially allowed NSSAI (if available and if the UE is roaming or is a non-subscribed SNPN), the S-NSSAI(s), if any, included in the:\ni)\trejected NSSAI for the failed or revoked NSSAA, for each and every access type;\nii)\tmapped S-NSSAI(s) for the rejected NSSAI for the current PLMN or SNPN, for each and every access type;\niii)\tmapped S-NSSAI(s) for the rejected NSSAI for the current registration area, associated with the same access type; \niv)\tmapped S-NSSAI(s) for the rejected NSSAI for the maximum number of UEs reached, associated with the same access type; or\nv)\tpartially rejected NSSAI, associated with 3GPP access;\n5)\tif the UE receives the S-NSSAI(s) included in the Rejected NSSAI IE, or if the UE receives the S-NSSAI(s) included in the Extended rejected NSSAI IE in non-roaming case when not in SNPN access operation mode or in the subscribed SNPN, remove from the stored pending NSSAI for the current PLMN and its equivalent PLMN(s) in the registration area or the current SNPN, the S-NSSAI(s), if any, included in the:\ni)\trejected NSSAI for the failed or revoked NSSAA, for each and every access type;\nii)\trejected NSSAI for the current PLMN or SNPN, for each and every access type;\niii)\trejected NSSAI for the current registration area, associated with the same access type; or\niv)\trejected NSSAI for the maximum number of UEs reached, associated with the same access type;\n6)\tif the UE receives the S-NSSAI(s) included in the Extended rejected NSSAI IE in roaming case or in a non-subscribed SNPN, remove from the stored pending NSSAI for the current PLMN and its equivalent PLMN(s) in the registration area or the current SNPN, the S-NSSAI(s), if any, included in the:\ni)\trejected NSSAI for the current PLMN or SNPN, for each and every access type;\nii)\trejected NSSAI for the current registration area, associated with the same access type; or\niii)\trejected NSSAI for the maximum number of UEs reached, associated with the same access type,\n\tif the mapped S-NSSAI(s) for the S-NSSAI in the stored pending NSSAI are stored in the UE, and all of the mapped S-NSSAI(s) are included in the Extended rejected NSSAI IE; and\n7)\tremove from the stored mapped S-NSSAI(s) for the pending NSSAI (if available and if the UE is roaming or is in a non-subscribed SNPN), the S-NSSAI(s), if any, included in the:\ni)\trejected NSSAI for the failed or revoked NSSAA, for each and every access type;\nii)\tmapped S-NSSAI(s) for the rejected NSSAI for the current PLMN or SNPN, for each and every access type;\niii)\tmapped S-NSSAI(s) for the rejected NSSAI for the current registration area, associated with the same access type; or\niv)\tmapped S-NSSAI(s) for the rejected NSSAI for the maximum number of UEs reached, associated with the same access type;\nIf the UE receives the CONFIGURATION UPDATE COMMAND message with the Registration requested bit of the Configuration update indication IE set to “registration requested” and contains no other parameters (see subclauses 5.4.4.2 and 5.4.4.3), the UE shall delete any stored rejected NSSAI.\n\tWhen the UE:\n1)\tenters state 5GMM-DEREGISTERED following an unsuccessful registration for 5GMM causes other than #62 “No network slices available” for the current PLMN or SNPN;\n2)\tsuccessfully registers with a new PLMN or a new SNPN;\n3)\tenters state 5GMM-DEREGISTERED following an unsuccessful registration with a new PLMN or a new SNPN; or\n4)\tperforms inter-system change from N1 mode to S1 mode and the UE successfully completes tracking area update procedure;\n\tand the UE is not registered with the PLMN or SNPN, which provided the rejected NSSAI, over another access, the rejected NSSAI for the current PLMN or SNPN and the rejected NSSAI for the failed or revoked NSSAA shall be deleted.\n\tWhen the UE receives ACTIVATE DEFAULT EPS BEARER CONTEXT REQUEST message provided with S-NSSAI and the PLMN ID in the Protocol configuration options IE or Extended protocol configuration options IE (see subclause 6.5.1.3 of 3GPP TS 24.301 [15]), the UE shall remove the S-NSSAI associated with the PLMN ID from the rejected NSSAI for the current PLMN. When the UE receives ACTIVATE DEFAULT EPS BEARER CONTEXT REQUEST message provided with S-NSSAI and the PLMN ID in the Protocol configuration options IE or Extended protocol configuration options IE (see subclause 6.5.1.3 of 3GPP TS 24.301 [15]), the UE may remove the S-NSSAI from the rejected NSSAI for the maximum number of UEs reached for each and every access type, if any, and stop the timer T3526 associated with the S-NSSAI if running.\n\tWhen the UE:\n1)\tderegisters over an access type;\n2)\tsuccessfully registers in a new registration area over an access type;\n3)\tenters state 5GMM-DEREGISTERED or 5GMM-REGISTERED following an unsuccessful registration in a new registration area over an access type; or\n4)\tperforms inter-system change from N1 mode to S1 mode and the UE successfully completes tracking area update procedure;\n\tthe rejected NSSAI for the current registration area corresponding to the access type and the partially rejected NSSAI shall be deleted;\nd)\tWhen the UE receives the pending NSSAI in the REGISTRATION ACCEPT message, the UE shall replace any stored pending NSSAI for this PLMN or SNPN with the new pending NSSAI received in the REGISTRATION ACCEPT message for this PLMN or SNPN. If the UE does not receive the pending NSSAI in the REGISTRATION ACCEPT message and the “NSSAA to be performed” indicator is not set to “Network slice-specific authentication and authorization is to be performed” in the 5GS registration result IE of the REGISTRATION ACCEPT message, the UE shall delete the stored pending NSSAI, if any, for this PLMN and its equivalent PLMN(s) in the registration area or this SNPN.\n\tIf the registration area contains TAIs belonging to different PLMNs, which are equivalent PLMNs, then for each of the equivalent PLMNs, the UE shall replace any stored pending NSSAI with the pending NSSAI received in the registered PLMN.\n\tWhen the UE:\n1)\tderegisters with the current PLMN or SNPN using explicit signalling or enters state 5GMM-DEREGISTERED for the current PLMN or SNPN;\n2)\tsuccessfully registers with a new PLMN not in the list of equivalent PLMNs or a new SNPN;\n3)\tenters state 5GMM-DEREGISTERED following an unsuccessful registration with a new PLMN or SNPN; or\n4)\tsuccessfully initiates an attach or tracking area update procedure in S1 mode and the UE is operating in single-registration mode;\n\tand the UE is not registered with the PLMN or SNPN, which provided pending NSSAI, over another access, the pending NSSAI for the current PLMN and its equivalent PLMN(s) in the registration area or the current SNPN shall be deleted;\ne)\tWhen the UE receives the Network slicing indication IE with the Network slicing subscription change indication set to \"Network slicing subscription changed\" in the REGISTRATION ACCEPT message or in the CONFIGURATION UPDATE COMMAND message, the UE shall delete the network slicing information for each of the PLMNs or SNPNs that the UE has slicing information stored for (excluding the current PLMN or SNPN). The UE shall delete any stored rejected NSSAI and stop any timer T3526 associated with a deleted S-NSSAI in the rejected NSSAI for the maximum number of UEs reached if running. The UE shall not delete the default configured NSSAI. Additionally, the UE shall update the network slicing information for the current PLMN or SNPN (if received) as specified above in bullets a), b), c) and d);\nf)\tWhen the UE receives the new default configured NSSAI included in the default configured NSSAI update data in the Payload container IE of DL NAS TRANSPORT message, the UE shall replace any stored default configured NSSAI with the new default configured NSSAI. In case of SNPN, the UE shall replace the stored default configured NSSAI associated with the selected entry of the \"list of subscriber data\" or the PLMN subscription with the new default configured NSSAI; and\ng)\tWhen the UE receives the on-demand NSSAI in the REGISTRATION ACCEPT message or CONFIGURATION UPDATE COMMAND message, the UE shall replace any stored on-demand NSSAI for the serving PLMN with the new on-demand NSSAI.\n\n\n* * * Next Change * * * *\nC.1\tStorage of 5GMM information for UEs not operating in SNPN access operation mode\nThe following 5GMM parameters shall be stored on the USIM if the corresponding file is present:\na)\t5G-GUTI;\nb)\tlast visited registered TAI;\nc)\t5GS update status;\nd)\t5G NAS security context parameters from a full native 5G NAS security context (see 3GPP TS 33.501 [24]);\ne)\tKAUSF and KSEAF (see 3GPP TS 33.501 [24]);\nf)\tSOR counter (see subclause 9.11.3.51); and\ng)\tUE parameter update counter (see subclause 9.11.3.53A);\nThe UE may support multiple records of NAS security context storage for multiple registration (see 3GPP TS 31.102 [22]). If the UE supports multiple records of NAS security context storage for multiple registration, the first 5G security context of one access shall be stored in record 1 of the 5G NAS Security Context USIM file for that access and the second 5G security context of that access shall be stored in record 2 of the same file. The presence and format of corresponding files on the USIM is specified in 3GPP TS 31.102 [22].\nIf the corresponding file is not present on the USIM, these 5GMM parameters are stored in a non-volatile memory in the ME together with the SUPI from the USIM. These 5GMM parameters can only be used if the SUPI from the USIM matches the SUPI stored in the non-volatile memory; else the UE shall delete the 5GMM parameters.\nThe following 5GMM parameters shall be stored in a non-volatile memory in the ME together with the SUPI from the USIM:\n-\tconfigured NSSAI(s);\n-\tNSSRG information;\n-\tS-NSSAI time validity information;\n-\tS-NSSAI location validity information;\n-\t;\n-\tNSSAI inclusion mode(s);\n-\tMPS indicator;\n-\tMCS indicator;\n-\toperator-defined access category definitions;\n-\tnetwork-assigned UE radio capability IDs;\n-\t\"CAG information list\", if the UE supports CAG;\n-\tsignalled URSP (see 3GPP TS 24.526 [19]);\n-\tSOR-CMCI;\n-\tone or more lists of type \"list of PLMN(s) to be used in disaster condition\", if the UE supports MINT;\n-\tdisaster roaming wait range, if the UE supports MINT; \n-\tdisaster return wait range, if the UE supports MINT;\n-\tindication of whether disaster roaming is enabled in the UE; \n-\tindication of 'applicability of \"lists of PLMN(s) to be used in disaster condition\" provided by a VPLMN';\n-\tVPS URSP configuration; and\n-\tindication of whether interworking without N26 interface is supported.\nThe following 5GMM parameters should be stored in a non-volatile memory in the ME together with the SUPI from the USIM:\n-\tallowed NSSAI(s); and\n-\tpartially allowed NSSAI(s).\nEach configured NSSAI consists of S-NSSAI(s) stored together with a PLMN identity, if it is associated with a PLMN. The UE shall store the S-NSSAI(s) of the HPLMN. If the UE is in the VPLMN, the UE shall also store the configured NSSAI for the current PLMN and any necessary mapped S-NSSAI(s). The configured NSSAI(s) can only be used if the SUPI from the USIM matches the SUPI stored in the non-volatile memory of the ME; else the UE shall delete the configured NSSAI(s). A configured NSSAI may be associated with NSSRG information, S-NSSAI location validity information, S-NSSAI time validity information, NSAG information and .\nEach NSSAI inclusion mode is associated with a PLMN identity and access type. The NSSAI inclusion mode(s) can only be used if the SUPI from the USIM matches the SUPI stored in the non-volatile memory of the ME; else the UE shall delete the NSSAI inclusion mode(s).\nThe MPS indicator is stored together with a PLMN identity of the PLMN that provided it, and is valid in that RPLMN or equivalent PLMN. The MPS indicator can only be used if the SUPI from the USIM matches the SUPI stored in the non-volatile memory of the ME, else the UE shall delete the MPS indicator.\nThe MCS indicator is stored together with a PLMN identity of the PLMN that provided it, and is valid in that RPLMN or equivalent PLMN. The MCS indicator can only be used if the SUPI from the USIM matches the SUPI stored in the non-volatile memory of the ME, else the UE shall delete the MCS indicator.\nOperator-defined access category definitions are stored together with a PLMN identity of the PLMN that provided them, and is valid in that PLMN or equivalent PLMN. The operator-defined access category definitions can only be used if the SUPI from the USIM matches the SUPI stored in the non-volatile memory of the ME, else the UE shall delete the operator-defined access category definitions. The maximum number of stored operator-defined access category definitions is UE implementation dependent.\nEach network-assigned UE radio capability ID is stored together with a PLMN identity of the PLMN that provided it as well as a mapping to the corresponding UE radio configuration, and is valid in that PLMN. A network-assigned UE radio capability ID can only be used if the SUPI from the USIM matches the SUPI stored in the non-volatile memory of the ME, else the UE shall delete the network-assigned UE radio capability ID. The UE shall be able to store at least the last 16 received network-assigned UE radio capability IDs. There shall be only one network-assigned UE radio capability ID stored for a given combination of PLMN identity and UE radio configuration and any existing UE radio capability ID shall be deleted when a new UE radio capability ID is added for the same combination of PLMN identity and UE radio configuration. If the UE receives a network-assigned UE radio capability ID with a Version ID value different from the value included in the network-assigned UE radio capability ID(s) stored at the UE for the serving PLMN, the UE may delete these stored network-assigned UE radio capability ID(s).\nThe allowed NSSAI(s) can be stored in a non-volatile memory in the ME together with the SUPI from the USIM. Allowed NSSAI consists of S-NSSAI(s) stored together with a PLMN identity, if it is associated with a PLMN. If the allowed NSSAI is stored, then the UE shall store the S-NSSAI(s) of the HPLMN. If the UE is in the VPLMN, the UE shall also store the allowed NSSAI for the serving PLMN and any necessary mapping of the allowed NSSAI for the serving PLMN to the S-NSSAI(s) of the HPLMN. The allowed NSSAI(s) can only be used if the SUPI from the USIM matches the SUPI stored in the non-volatile memory of the ME; else the UE shall delete the allowed NSSAI(s).\nThe partially allowed NSSAI(s) can be stored as allowed NSSAI(s) in a non-volatile memory in the ME together with the SUPI from the USIM. Partially allowed NSSAI consists of allowed S-NSSAI(s) and for each S-NSSAI a list of TAs for which the S-NSSAI is allowed, together with a PLMN identity.\nIf the UE is registered for emergency services, the UE shall not store the 5GMM parameters described in this annex on the USIM or in non-volatile memory. Instead the UE shall temporarily store these parameters locally in the ME and the UE shall delete these parameters when the UE is deregistered from emergency services (e.g. before registering for normal service).\nIf the UE is configured for eCall only mode as specified in 3GPP TS 31.102 [22], the UE shall not store the 5GMM parameters described in this annex on the USIM or in non-volatile memory. Instead the UE shall temporarily store these parameters locally in the ME and the UE shall delete these parameters when the UE enters 5GMM-DEREGISTERED.eCALL-INACTIVE state, the UE is switched-off or the USIM is removed.\nThe \"CAG information list\" can only be used if the SUPI from the USIM matches the SUPI stored in the non-volatile memory of the ME; else the UE shall delete the \"CAG information list\".\nThe handling of the SOR-CMCI stored in the non-volatile memory in the ME is specified in 3GPP TS 23.122 [5].\nEach \"list of PLMN(s) to be used in disaster condition\" is stored together with the PLMN identity of the PLMN that provided it. The stored lists of type \"list of PLMN(s) to be used in disaster condition\" can only be used if the SUPI from the USIM matches the SUPI stored in the non-volatile memory of the ME; else the UE shall delete the lists of type \"list of PLMN(s) to be used in disaster condition\". The UE shall store at least the \"list of PLMN(s) to be used in disaster condition\" provided by the HPLMN or EHPLMN. If the 'applicability of \"lists of PLMN(s) to be used in disaster condition\" provided by a VPLMN' is set to \"true\", the UE should also store the \"list of PLMN(s) to be used in disaster condition\" provided by the VPLMN. The maximum number of stored lists of type \"list of PLMN(s) to be used in disaster condition\" provided by a PLMN other than the HPLMN or EHPLMN is UE implementation dependent.\nThe disaster roaming wait range can only be used if the SUPI from the USIM matches the SUPI stored in the non-volatile memory of the ME; else the UE shall delete the disaster roaming wait range.\nThe disaster return wait range can only be used if the SUPI from the USIM matches the SUPI stored in the non-volatile memory of the ME; else the UE shall delete the disaster return wait range.\nThe indication of whether disaster roaming is enabled in the UE can only be used if the SUPI from the USIM matches the SUPI stored in the non-volatile memory of the ME; else the UE shall delete the indication of whether disaster roaming is enabled in the UE.\nThe indication of 'applicability of \"lists of PLMN(s) to be used in disaster condition\" provided by a VPLMN' can only be used if the SUPI from the USIM matches the SUPI stored in the non-volatile memory of the ME; else the UE shall delete the indication of 'applicability of \"lists of PLMN(s) to be used in disaster condition\" provided by a VPLMN'.\n\n* * * Next Change * * * *\nC.2\tStorage of 5GMM information for UEs operating in SNPN access operation mode\nThe 5GMM information for UEs operating in SNPN access operation mode and not registering or registered for the onboarding service in SNPN are stored according to the following conditions:\n-\tif the UE does not support access to an SNPN using credentials from a credentials holder and equivalent SNPNs, the following 5GMM parameters shall be stored per subscribed SNPN in a non-volatile memory in the ME together with the subscriber identifier associated with the SNPN identity of the SNPN in the \"list of subscriber data\" configured in the ME (see 3GPP TS 23.122 [5]) or with the SUPI from the USIM if no subscriber identifier is configured in the entry of the \"list of subscriber data\" associated with the SNPN identity and the UE has a valid USIM;and\n-\tif the UE supports access to an SNPN using credentials from a credentials holder, equivalent SNPNs or both, the following 5GMM parameters shall be stored in a non-volatile memory in the ME per:\ni)\tthe subscribed SNPN together with the subscriber identifier associated with the selected entry in the \"list of subscriber data\" configured in the ME (see 3GPP TS 23.122 [5]) or with the SUPI from the USIM if no subscriber identifier is configured in the selected entry of the \"list of subscriber data\" configured in the ME and the UE has a valid USIM; or\nii)\tif the UE supports access to an SNPN using credentials from a credentials holder, the PLMN subscription together with the SUPI from the USIM which is associated with the PLMN subscription:\na)\t5G-GUTI;a1)\tNID of the registered SNPN;\nb)\tlast visited registered TAI;\nc)\t5GS update status;\nd)\t5G NAS security context parameters from a full native 5G NAS security context (see 3GPP TS 33.501 [24]);\ne)\tKAUSF and KSEAF (see 3GPP TS 33.501 [24]);\nf)\tUE parameter update counter (see subclause 9.11.3.53A);\ng)\tconfigured NSSAI(s);\ng1)\tNSSRG information;\ng2)\tS-NSSAI time validity information;\ng3) S-NSSAI location validity information;\ng4)\t;\nh)\tNSSAI inclusion mode(s);\ni)\tMPS indicator;\nj)\tMCS indicator;\nk)\toperator-defined access category definitions;\nl)\tnetwork-assigned UE radio capability IDs;\nm)\tzero or more instances of signalled URSP (see 3GPP TS 24.526 [19]), each associated with a non-subscribed SNPN, the subscribed SNPN or the HPLMN, which provided the URSP;\nm1)\tzero or more instances of pre-configured URSP rules (see 3GPP TS 24.526 [19]), each associated with the subscribed SNPN or the HPLMN, which provided the URSP;\nn)\toptionally a non-subscribed SNPN signalled URSP handling indication indicating whether the UE is allowed to accept URSP signalled by non-subscribed SNPNs;\no)\tpermanently forbidden SNPNs list;\no1)\tpermanently forbidden SNPNs for access for localized services in SNPN;\np)\ttemporarily forbidden SNPNs;\np1)\ttemporarily forbidden SNPNs for access for localized services in SNPN;\nq)\tSOR counter (see subclause 9.11.3.51);\nr)\tSOR-CMCI; and\ns)\toptionally, the SNPN selection parameters associated with the PLMN subscription (see 3GPP TS 23.122 [5] subclause 4.9.3.0).\nThe 5GMM information for UEs operating in SNPN access operation mode and registering or registered for the onboarding service in SNPN are stored as follows:\na)\t5G-GUTI;\nb)\tlast visited registered TAI;\nc)\t5GS update status;\nd)\t5G NAS security context parameters from a full native 5G NAS security context (see 3GPP TS 33.501 [24]);\ne)\tKAUSF and KSEAF (see 3GPP TS 33.501 [24]);\nf)\tUE parameter update counter (see subclause 9.11.3.53A);\ng)\tnetwork-assigned UE radio capability IDs;\nh)\t\"permanently forbidden SNPNs\" list for onboarding services; and\ni)\t\"temporarily forbidden SNPNs\" list for onboarding services.\nThe 5GMM information for UEs operating in SNPN access operation mode are stored according to the following conditions:\n-\tif the UE does not support access to an SNPN using credentials from a credentials holder, equivalent SNPNs or both, the following 5GMM parameters should be stored per subscribed SNPN in a non-volatile memory in the ME together with the subscriber identifier associated with the SNPN identity of the SNPN in the \"list of subscriber data\" configured in the ME (see 3GPP TS 23.122 [5]) or with the SUPI from the USIM if no subscriber identifier is configured in the entry of the \"list of subscriber data\" associated with the SNPN identity and the UE has a valid USIM; and\n-\tif the UE supports access to an SNPN using credentials from a credentials holder, equivalent SNPNs or both, the following 5GMM parameters should be stored in a non-volatile memory in the ME per:\ni)\tthe subscribed SNPN together with the subscriber identifier associated with the selected entry in the \"list of subscriber data\" configured in the ME (see 3GPP TS 23.122 [5]) or with the SUPI from the USIM if no subscriber identifier is configured in the selected entry of the \"list of subscriber data\" configured in the ME and the UE has a valid USIM; or\nii)\tif the UE supports access to an SNPN using credentials from a credentials holder, the PLMN subscription together with the SUPI from the USIM which is associated with the PLMN subscription:\na)\tallowed NSSAI(s).\nIf the 5GMM parameters are associated with the PLMN subscription, then the 5GMM parameters can only be used if the SUPI from the USIM which is associated with the selected PLMN subscription matches the SUPI stored in the non-volatile memory; else the UE shall delete the 5GMM parameters.\nIf the 5GMM parameters are associated with the subscribed SNPN of the entry in the \"list of subscriber data\", then the 5GMM parameters can only be used if the subscriber identifier of the selected entry of the \"list of subscriber data\" matches the subscriber identifier stored in the non-volatile memory or if the subscriber identifier from the USIM matches the subscriber identifier stored in the non volatile memory, no subscriber identifier is configured in the selected entry of the \"list of subscriber data\" configured in the ME and the UE has a valid USIM.\nEach configured NSSAI consists of S-NSSAI(s) stored together with an SNPN identity, if it is associated with an SNPN. A configured NSSAI may be associated with NSSRG information, S-NSSAI time validity information, S-NSSAI location validity information, NSAG information and .\nEach NSSAI inclusion mode is associated with an SNPN identity and access type.\nThe MPS indicator is stored together with an SNPN identity of the SNPN that provided it, and is valid in that registered SNPN or equivalent SNPN.\nThe MCS indicator is stored together with an SNPN identity of the SNPN that provided it, and is valid in that registered SNPN or equivalent SNPN.\nOperator-defined access category definitions are stored together with an SNPN identity of the SNPN that provided them, and are valid in that SNPN or equivalent SNPN. The maximum number of stored operator-defined access category definitions is UE implementation dependent.\nEach network-assigned UE radio capability ID is stored together with an SNPN identity of the SNPN that provided it as well as a mapping to the corresponding UE radio configuration, and is valid in that SNPN. The UE shall be able to store at least the last 16 received network-assigned UE radio capability IDs. There shall be only one network-assigned UE radio capability ID stored for a given combination of SNPN identity and UE radio configuration and any existing UE radio capability ID shall be deleted when a new UE radio capability ID is added for the same combination of SNPN identity and UE radio configuration. If the UE receives a network-assigned UE radio capability ID with a Version ID value different from the value included in the network-assigned UE radio capability ID(s) stored at the UE for the serving SNPN, the UE may delete these stored network-assigned UE radio capability ID(s).\nThe handling of the SOR-CMCI stored in the non-volatile memory in the ME is specified in 3GPP TS 23.122 [5].\nThe allowed NSSAI(s) can be stored in a non-volatile memory in the ME. Allowed NSSAI consists of S-NSSAI(s) stored together with an SNPN identity, if it is associated with an SNPN.\nThe partially allowed NSSAI(s) can be stored as allowed NSSAI(s) in a non-volatile memory in the ME. Partially allowed NSSAI consists of S-NSSAI(s) and a list of TAs for which the S-NSSAI is allowed, stored together with an SNPN identity, if it is associated with an SNPN.\n\n\n* * * End of changes * * * *\n",
    "metadata": {
        
            "WG": "TSG-CT WG1",
            "Meeting": "#147",
            "Meeting_location": "Athens, Greece",
            "Meeting_date": "26-02-2024",
            "TDoc_no.": "C1-241256",
            "TDoc_no._was": ""
        ,
        "spec_number": "24.501",
        "CR_number": "6125",
        "revise_number": "1",
        "Current_version": "18.5.0",
        "Incorporates_to_version": "18.6.0",
        "Proposed_change_affects_UICC": "ME,Core Network",
        "Title": "Termilogy align of the Network slice usage control information ",
        "Source_to_WG": "Huawei, HiSilicon",
        "Source_to_TSG": "CT1",
        "Work_item_code": "eNS_Ph3",
        "Date": "2024-02-18",
        "Category": "F (correction)",
        "Release": "Rel-18",
        "WG_status": "agreed",
        "TSG_status": "approved"
    }
}