{
    "page_content": "3GPP TSG-CT WG1 Meeting #147\tC1-241259\nAthens, Greece, 26 February-1 March 2024\n\n\n\n\n* * * First Change * * * *\n\n5.3.6\tMobile initiated connection only mode\nThe UE can request the use of mobile initiated connection only (MICO) mode during the registration procedure (see 3GPP TS 23.501 [8] and 3GPP TS 23.502 [9]). The UE shall not request use of MICO mode over non-3GPP access. Furthermore, the UE in 3GPP access shall not request the use of MICO mode during:\na)\ta registration procedure for initial registration for emergency services (see subclause 5.5.1.2);\nb)\ta registration procedure for initial registration for initiating an emergency PDU session (see subclause 5.5.1.2);\nc)\ta registration procedure for mobility and periodic registration update (see subclause 5.5.1.3) for initiating an emergency PDU session if the UE is in the state 5GMM-REGISTERED.ATTEMPTING-REGISTRATION-UPDATE; or\nd)\ta registration procedure for mobility and periodic registration update (see subclause 5.5.1.3) when the UE has an emergency PDU session established.\nIf the UE requests the use of MICO mode, the network can accept the use of MICO mode by providing a MICO indication when accepting the registration procedure. The UE may use MICO mode only if the network has provided the MICO indication IE during the last registration procedure. The UE may also request an active time value together with the MICO mode indication during the registration procedure. If the UE requests an active time by including an active time value, the UE may also include the Requested T3512 value IE to request a particular T3512 value to be allocated.\nIf the network accepts the use of MICO mode and does not include an active time value in T3324 IE to the UE, the AMF may include an \"all PLMN registration area allocated\" indication in the MICO indication IE to the UE. If the UE indicated the support for strictly periodic registration timer in the MICO indication IE to the network, the network may include a \"strictly periodic registration timer supported\" indication in the MICO indication IE to the UE.\nIf the UE requested the use of active time by including an active time value and the network accepts the use of MICO mode and the use of active time, the AMF shall include an active time value in the T3324 IE to the UE. If the AMF indicates active time value to the UE, AMF should not indicate \"all PLMN registration area allocated\" indication in the MICO indication IE to the UE. Upon entering 5GMM-IDLE mode, AMF shall start the active timer with the active time value indicated to the UE and shall consider the UE is reachable for paging as long as the timer is running. If the UE enters 5GMM-CONNECTED mode over 3GPP access when the active timer is running, the AMF shall stop the active timer.\nNOTE 1:\tThe active time value assigned by AMF can be different from the active time value requested by the UE. AMF assigns the active time value based on several factors, e.g. local configuration, expected UE behaviour, UE requested active time value, UE subscription information, network policies etc.\nIf the UE requested an active time and a requested T3512 value and the network accepts the use of MICO mode, the AMF shall take the UE requested T3512 value into consideration when assigning a value of timer T3512 to the UE.\nIf the network accepts the use of MICO mode, the UE may deactivate the AS layer and activate MICO mode by entering the state 5GMM-REGISTERED.NO-CELL-AVAILABLE if:\na)\tthe UE is in 5GMM-IDLE mode over3GPP access;\nb)\tthe UE is in the 5GMM-REGISTERED.NORMAL-SERVICE or 5GMM-REGISTERED.NON-ALLOWED-SERVICE (as described in subclause 5.3.5.2) state for 3GPP access; and\nc)\tno T3324 value is received from the network.\nIf the network accepts the use of MICO mode and indicates an active time value to the UE in a successful registration procedure, the UE shall start the timer T3324 with the value received from the network after entering 5GMM-IDLE mode over 3GPP access. At the expiry of the timer T3324, the UE may activate MICO mode by entering the state 5GMM-REGISTERED.NO-CELL-AVAILABLE if the UE is in the 5GMM-REGISTERED.NORMAL-SERVICE or 5GMM-REGISTERED.NON-ALLOWED-SERVICE (as described in subclause 5.3.5.2) state for 3GPP access. If the UE enters 5GMM-CONNECTED mode over 3GPP access when the timer T3324 is running, the UE shall stop the timer T3324.\nWhen MICO mode is activated, all NAS timers are stopped and associated procedures aborted except for timers T3512, T3346, T3447, T3396, T3584, T3585, any back-off timers, T3247, and the timer T controlling the periodic search for HPLMN or EHPLMN or higher prioritized PLMNs (see 3GPP TS 23.122 [5]).\nNOTE 2:\tWhen MICO mode is activated and if the UE is also registered over the non-3GPP access, the AMF will not send a NOTIFICATION message with access type indicating 3GPP access over the non-3GPP access for PDU sessions associated with 3GPP access.\nThe UE may deactivate MICO mode and activate the AS layer at any time. Upon deactivating MICO mode, the UE may initiate 5GMM procedures (e.g. for the transfer of mobile originated signalling or user data).\nWhen an emergency PDU session is successfully established after the MICO mode was enabled, the UE and the AMF shall locally disable MICO mode. The UE and the AMF shall not enable MICO mode until the AMF accepts the use of MICO mode in the next registration procedure. To enable an emergency call back, the UE should wait for a UE implementation-specific duration of time before requesting the use of MICO mode after the completion of the emergency services.\nIf the AMF accepts the use of MICO mode and does not indicate \"strictly periodic registration timer supported\" in the MICO indication IE to the UE, the AMF starts the implicit de-registration timer for 3GPP access when entering 5GMM-IDLE mode for 3GPP access. If AMF accepts the use of MICO mode and indicates \"strictly periodic registration timer supported\" in the MICO indication IE to the UE, AMF shall start the strictly periodic monitoring timer with T3512 value indicated in the T3512 value IE after the registration procedure is completed. The AMF shall neither stop nor reset the strictly periodic monitoring timer when the NAS signalling connection is established or released for the UE. If the strictly periodic monitoring timer expires when NAS signalling connection is established for the UE, AMF shall restart the strictly periodic monitoring timer with the T3512 value, otherwise AMF shall start the implicit de-registration timer.\nWhen an emergency PDU session is successfully established and the MICO mode is disabled, the UE shall stop timer T3512 if running and the AMF shall stop strictly periodic monitoring timer if running. The UE and the AMF shall behave as if no \"strictly periodic registration timer supported\" indication was given to the UE in the last registration attempt.\nUpon successful completion of an attach procedure or tracking area updating procedure after inter-system change from N1 mode to S1 mode (see 3GPP TS 24.301 [15]), the UE operating in single-registration mode shall locally disable MICO mode. After inter-system change from S1 mode to N1 mode, the UE operating in single-registration mode may re-negotiate MICO mode with the network during the registration procedure for mobility and periodic registration update.\nWhen MICO mode is activated for a UE that has joined one or more multicast MBS sessions, the UE may deactivate MICO mode and activate the AS layer at the MBS start time and at any of the scheduled activation times of a multicast MBS session, if any of those times are available as specified in 3GPP TS 23.247 [53].\nWhen MICO mode is activated for a UE, the UE may deactivate MICO mode and activate the AS layer at the broadcast start time and at any of the scheduled broadcast activation times of a broadcast MBS session if any of those times are available as specified in 3GPP TS 23.247 [53].\nNOTE 3:\tThe UE can obtain via the service announcement an MBS start time, a sequence of scheduled activation times (e.g. a first time and a periodicity) or both, of a multicast MBS session as described in 3GPP TS 23.247 [53], or both, which is out of scope of this specification. Similarly, the UE can obtain via the service announcement a broadcast start time, a sequence of scheduled broadcast activation times (e.g. a first time and a periodicity) or both, of a broadcast MBS session as described in 3GPP TS 23.247 [53], which is out of scope of this specification.\nNOTE 4:\tDeactivating MICO mode and activating the AS layer at the MBS start time and the scheduled multicast activation times of a multicast MBS session allows the UE to listen to paging for a multicast MBS session which the has UE joined and to respond to it if received. How long the UE needs to listen to paging is up to UE implementation. Similarly, deactivating MICO mode and activating the AS layer at the broadcast start time and the scheduled broadcast activation times of a broadcast MBS session allows the UE to acquire the traffic of the broadcast MBS session.\nWhen MICO mode is activated, the UE is allowed to join one or more multicast MBS sessions. In that case, the UE can deactivate MICO mode and activate the AS layer at the MBS start time and at any of the scheduled activation times of a multicast MBS session if any of those times are available as specified in 3GPP TS 23.247 [53], and the UE joins one or more multicast MBS sessions by using the UE-requested PDU session establishment procedure or the UE-requested PDU session modification procedure (see subclauses 6.4.1.2 and 6.4.2.2).\nNOTE 5:\tIt is up to UE implementation whether to leave one or more multicast MBS sessions after each deactivation of each multicast MBS session and to re-join again at the next activation time or to keep a multicast MBS session that the UE has joined for the whole period of the session, as described in 3GPP TS 23.247 [53].\n\n* * * End of Changes * * * *\n\n",
    "metadata": {
      
            "WG": "TSG-CT WG1",
            "Meeting": "#147",
            "Meeting_location": "Athens, Greece",
            "Meeting_date": "26-02-2024",
            "TDoc_no.": "C1-241259",
            "TDoc_no._was": ""
        ,
        "spec_number": "24.501",
        "CR_number": "6129",
        "revise_number": "",
        "Current_version": "18.5.0",
        "Incorporates_to_version": "18.6.0",
        "Proposed_change_affects_UICC": "ME",
        "Title": "Correction to timers handling in MICO mode",
        "Source_to_WG": "MediaTek Inc.",
        "Source_to_TSG": "C1",
        "Work_item_code": "5GProtoc18",
        "Date": "2024-02-27",
        "Category": "F (correction)",
        "Release": "Rel-18",
        "WG_status": "agreed",
        "TSG_status": "approved"
    }
}