{
    "page_content": "3GPP TSG-CT WG1 Meeting #147\tC1-241747\nAthens, Greece, 26 February-1 March 2024\n\n\n\n\n* * * First Change * * * *\n\n4.6.1\tGeneral\nThe 5GS supports network slicing as described in 3GPP TS 23.501 [8]. Within a PLMN or SNPN, a network slice is identified by an S-NSSAI, which is comprised of a slice/service type (SST) and a slice differentiator (SD). Inclusion of an SD in an S-NSSAI is optional. A set of one or more S-NSSAIs is called the NSSAI. The following S-NSSAIs and NSSAIs are defined in 3GPP TS 23.501 [8]:\na)\tconfigured NSSAI;\nb)\trequested NSSAI;\nc)\tallowed NSSAI;\nd)\tsubscribed S-NSSAIs;\ne)\tpending NSSAI;\nf)\talternative S-NSSAIs; and\ng)\tpartially allowed NSSAI.\nThe following NSSAIs are defined in the present document:\na)\trejected NSSAI for the current PLMN or SNPN;\nb)\trejected NSSAI for the current registration area;\nc)\trejected NSSAI for the failed or revoked NSSAA;\nd)\trejected NSSAI for the maximum number of UEs reached;\ne)\talternative NSSAI; and\nf)\tpartially rejected NSSAI.\nIn roaming scenarios, rejected NSSAI for the current PLMN or SNPN, rejected NSSAI for the current registration area, rejected NSSAI for the maximum number of UEs reached, or partially rejected NSSAI includes one or more S-NSSAIs for the current PLMN and also contains a set of mapped S-NSSAI(s). An S-NSSAI included in the rejected NSSAI for the failed or revoked NSSAA is an HPLMN S-NSSAI.\nIn case of a PLMN, a serving PLMN may configure a UE with:\na)\tthe configured NSSAI per PLMN;\nb)\tNSSRG information if the UE has indicated that it supports the subscription-based restrictions to simultaneous registration of network slices feature;\nc)\tnetwork slice usage control information if the UE has indicated it supports the network slice usage control feature;\nd)\tS-NSSAI time validity information if the UE has indicated that it supports S-NSSAI time validity information; and\ne)\tS-NSSAI location validity information if the UE has indicated that it supports S-NSSAI location validity information.\nIn addition, the HPLMN may configure a UE with a single default configured NSSAI and consider the default configured NSSAI as valid in a PLMN for which the UE has neither a configured NSSAI nor an allowed NSSAI. The support for NSSRG information by the UE and the network, respectively, is optional.\nNOTE 0:\the network slice usage control feature is not supported in roaming scenarios\nNOTE 1:\tThe value(s) used in the default configured NSSAI are expected to be commonly decided by all roaming partners, e.g., values standardized by 3GPP or other bodies.\nIn case of an SNPN, the SNPN may configure a UE which is neither registering nor registered for onboarding services in SNPN with:\na)\ta configured NSSAI applicable to the SNPN;\nb)\tNSSRG information if the UE has indicated that it supports the subscription-based restrictions to simultaneous registration of network slices feature;\nc)\tS-NSSAI time validity information if the UE has indicated that it supports S-NSSAI time validity information;\nd)\tnetwork slice usage control information if the UE has indicated it supports the network slice usage control feature; and\ne)\tS-NSSAI location validity information if the UE has indicated that it supports S-NSSAI location validity information.\nIn addition, the credential holder may configure a single default configured NSSAI associated with the selected entry of the \"list of subscriber data\" or the PLMN subscription and consider the default configured NSSAI as valid in a SNPN for which the UE has neither a configured NSSAI nor an allowed NSSAI. If the UE is registering or registered for onboarding services in SNPN, the serving SNPN shall not provide a configured NSSAI to the UE. The support for NSSRG information by the UE and the network, respectively, is optional.\nThe allowed NSSAI and the rejected NSSAI for the current registration area are managed per access type independently, i.e. 3GPP access or non-3GPP access, and is applicable for the registration area. If the UE does not have a valid registration area, the rejected NSSAI for the current registration area is applicable to the tracking area on which it was received. If the registration area contains TAIs belonging to different PLMNs, which are equivalent PLMNs, the allowed NSSAI, the rejected NSSAI for the current registration area, rejected NSSAI for the failed or revoked NSSAA and rejected NSSAI for the maximum number of UEs reached are applicable to these PLMNs in this registration area.\nThe allowed NSSAI that is associated with a registration area containing TAIs belonging to different PLMNs, which are equivalent PLMNs, can be used to form the requested NSSAI for any of the equivalent PLMNs when the UE is outside of the registration area where the allowed NSSAI was received.\nWhen the network slice-specific authentication and authorization procedure is to be initiated for one or more S-NSSAIs in the requested NSSAI or the network slice-specific authentication and authorization procedure is ongoing for one or more S-NSSAIs, these S-NSSAI(s) will be included in the pending NSSAI. When the network slice-specific authentication and authorization procedure is completed for an NSSAI that has been in the pending NSSAI, the S-NSSAI will be moved to the allowed NSSAI or rejected NSSAI depending on the outcome of the procedure. The AMF sends the updated allowed NSSAI to the UE over the same access of the requested S-NSSAI. The AMF sends the updated partially allowed NSSAI to the UE only over the 3GPP access. The AMF sends the updated rejected NSSAI over either 3GPP access or non-3GPP access. The pending NSSAI is managed regardless of access type i.e. the pending NSSAI is applicable to both 3GPP access and non-3GPP access for the current PLMN even if sent over only one of the accesses. If the registration area contains TAIs belonging to different PLMNs, which are equivalent PLMNs, the pending NSSAI is applicable to these PLMNs in this registration area.\nThe rejected NSSAI for the current PLMN or SNPN is applicable for the whole registered PLMN or SNPN regardless of the access type. The AMF shall only send a rejected NSSAI for the current PLMN when the registration area consists of TAIs that only belong to the registered PLMN. If the UE receives a rejected NSSAI for the current PLMN, and the registration area also contains TAIs belonging to different PLMNs, the UE shall treat the received rejected NSSAI for the current PLMN as applicable to the whole registered PLMN.\nThe rejected NSSAI for the failed or revoked NSSAA includes one or more S-NSSAIs that have failed the network slice-specific authentication and authorization or for which the authorization have been revoked, and are applicable for the whole registered PLMN or SNPN regardless of the access type.\nThe rejected NSSAI for the maximum number of UEs reached is applicable for the whole registered PLMN or SNPN, and the access type over which the rejected NSSAI was sent. The AMF shall send a rejected NSSAI including S-NSSAI(s) with the rejection cause \"S-NSSAI not available due to maximum number of UEs reached\", when one or more S-NSSAIs are indicated that the maximum number of UEs has been reached. If the timer T3526 associated with the S-NSSAI(s) was started upon reception of the rejected NSSAI for the maximum number of UEs reached, the UE may remove the S-NSSAI(s) from the rejected NSSAI including S-NSSAI(s) with the rejection cause \"S-NSSAI not available due to maximum number of UEs reached\", if the timer T3526 associated with the S-NSSAI(s) expires. If one or more S-NSSAIs are removed from the rejected NSSAI for the maximum number of UEs reached, the timer T3526 associated with the removed S-NSSAI(s) shall be stopped, if running. The UE shall not stop the timer T3526 if the UE selects an E-UTRA cell connected to EPC.\nIf the UE receives a rejected NSSAI for the maximum number of UEs reached, the registration area contains TAIs belonging to different PLMNs, which are equivalent PLMNs, the UE shall treat the received rejected NSSAI for the maximum number of UEs reached as applicable to these equivalent PLMNs when the UE is in this registration area.\nIf the UE has indicated that the UE supports network slice replacement feature and the AMF determines to provide the mapping information between the S-NSSAI to be replaced and the alternative S-NSSAI to the UE, the network shall provide the UE with the alternative NSSAI. The alternative NSSAI is managed per access type independently, i.e. 3GPP access or non-3GPP access, and is applicable for the registration area.\nIf the UE has indicated that the UE supports the partial network slice feature and includes the S-NSSAI(s) in the requested NSSAI, the AMF determines the S-NSSAI(s) to be included in the partially allowed NSSAI or the partially rejected NSSAI as specified in subclause 4.6.2.11. When the AMF provides both the partially allowed NSSAI and the partially rejected NSSAI to the UE, each S-NSSAI shall be either in the partially allowed NSSAI or in the partially rejected NSSAI but not both. The number of S-NSSAIs included in the partially allowed NSSAI or the partially rejected NSSAI shall not exceed 7. The number of S-NSSAI stored in the partially allowed NSSAI and the allowed NSSAI shall not exceed 8. The partially allowed NSSAI is only applicable to 3GPP access and is applicable for the registration area. The partially rejected NSSAI is only applicable to 3GPP access and is applicable for the registration area.\nNOTE 2:\tBased on local policies, the UE can remove an S-NSSAI from the rejected NSSAI for the failed or revoked NSSAA when the UE wants to register to the slice identified by this S-NSSAI.\nNOTE 3:\tBased on network local policy, network slice-specific authentication and authorization procedure can be initiated by the AMF for an S-NSSAI in rejected NSSAI for the failed or revoked NSSAA when the S-NSSAI is requested by the UE based on its local policy.\nNOTE 4: At least one S-NSSAI in the default configured NSSAI or at least one default S-NSSAI is recommended as not subject to network slice-specific authentication and authorization, in order to ensure that at least one PDU session can be established to access service, even when Network Slice-specific Authentication and Authorization fails.\nNOTE 5:\tAt least one S-NSSAI in the default configured NSSAI or at least one default S-NSSAI is recommended as not subject to network slice admission control, in order to ensure that at least one PDU session can be established to access service.\nNOTE 6:\tThe rejected NSSAI can be provided by the network via either Rejected NSSAI IE or the Extended rejected NSSAI IE.\n\n* * * Next Change * * * *\n4.6.2.9\tMobility management based network slice usage control\nIf the UE and the network support network slice usage control, the AMF monitors network slice usage by running a slice deregistration inactivity timer per S-NSSAI and access type. The AMF may also provide on-demand NSSAI to the UE in the REGISTRATION ACCEPT message or in the CONFIGURATION UPDATE COMMAND message. The on-demand NSSAI consists of one or more on-demand S-NSSAIs and, optionally, the slice deregistration inactivity timer per on-demand S-NSSAI.\nThe slice deregistration inactivity timer is:\na)\tstarted when there is no established PDU session, including any MA PDU session, associated with the S-NSSAI over the corresponding access type; and\nb)\tstopped and reset when at least a PDU session, including any MA PDU session, associated with the S-NSSAI is successfully established over the corresponding access type(s) or the S-NSSAI is removed from the allowed NSSAI.\nIf the slice deregistration inactivity timer value is updated, the AMF updates the stored timer value and may provide the updated timer value to the UE in the REGISTRATION ACCEPT message or the CONFIGURATION UPDATE COMMAND message.\nWhen the UE receives an updated slice deregistration inactivity timer value in the REGISTRATION ACCEPT message or the CONFIGURATION UPDATE COMMAND message from the AMF, the UE updates the stored timer value.\nUpon expiry of the slice deregistration inactivity timer, the AMF locally removes the S-NSSAI from the allowed NSSAI over the access type. In addition, the AMF may send the CONFIGURATION UPDATE COMMAND message to the UEs with the new allowed NSSAI.\nThe UE includes the on-demand S-NSSAI which the UE requests in the requested NSSAI during the registration procedure. Upon expiry of the slice deregistration inactivity timer, the UE locally removes the S-NSSAI from the allowed NSSAI over the access type.\nIf the UE supports network slice usage control, the AMF provides on-demand NSSAI in the Configured NSSAI to the UE in the REGISTRATION ACCEPT message or in the UE Configuration Update Command message. The on-demand NSSAI consists of one or more configured S-NSSAIs.\nThe on-demand S-NSSAI(s) is deleted by the UE from the stored on-demand NSSAI, when the associated configured S-NSSAI(s) is deleted by the UE from the stored configured NSSAI.\nNOTE:\the network slice usage control feature is not supported in roaming scenarios.\n\n* * * End of Changes * * * *\n",
    "metadata": {
       
            "WG": "TSG-CT WG1",
            "Meeting": "#147",
            "Meeting_location": "Athens, Greece",
            "Meeting_date": "26-02-2024",
            "TDoc_no.": "C1-241747",
            "TDoc_no._was": ""
        ,
        "spec_number": "24.501",
        "CR_number": "6124",
        "revise_number": "2",
        "Current_version": "18.5.0",
        "Incorporates_to_version": "18.6.0",
        "Proposed_change_affects_UICC": "ME,Core Network",
        "Title": "Network slice usage control applicability in roaming scenarios",
        "Source_to_WG": "Huawei, HiSilicon",
        "Source_to_TSG": "CT1",
        "Work_item_code": "eNS_Ph3",
        "Date": "2024-02-06",
        "Category": "F (correction)",
        "Release": "Rel-18",
        "WG_status": "revised",
        "TSG_status": ""
    }
}